Revit 2024 API
MaterialNode.ThumbnailFile Property
 The path if a file that contains a thumbnail image of the material.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public string ThumbnailFile { get; }
Visual Basic
Public ReadOnly Property ThumbnailFile As String
	Get
Visual C++
public:
property String^ ThumbnailFile {
	String^ get ();
}
See Also
MaterialNode Class
Autodesk.Revit.DB Namespace